
2. В старом сафари осталась шняга в слайдере, видимо как-то неправильно считаются размеры бордера и следовательно вся ширина контейнера и кусок ovwerrflow:hidden - Скрин; ------- хм, в 5 виндосовском сафари я исправила эту штуку. возможно обратно другими изменениями откатила. нужно опять к сафари сходить наверное. ----------- это на потом оставь

3. Текстэдитор чуток вылезает - Скрин; ---------- нет нигде (айпад 2, самсунг галакси, хром, опера, фаирфокс), не знаю как проверить. ------------ это на айфон вот у меня в симуляторе на айфоне 5s ваще косяк большой https://up.kibakoapp.com/I64g6A8nRW, и снова старница начала не всю ширину занимать https://up.kibakoapp.com/a5dzfg7QAF -------- на настоящем айфоне тоже так? так бывает когда ресайзишь и не перезагружаешь потом


Мобилка - можешь сделать чтобы на мобилке стрелки пропадали, а фотка занимала все 100% ширины, а если вотка не горизонтальная а вертикальная то занимала максимум ширины, а высоту брала столько сколько может но оставляя места снижу для thumbs.






# 1591
# 1235
